In [1]:
import pandas as pd, sqlite3 as s3

In [2]:
conn = s3.connect("archive (2)/database.sqlite")
# c = conn.execute("select * from player")
# for l in c: print(l)

In [3]:
player_df = pd.read_sql_query("select * from player", conn)
player_df["DOB"] = pd.to_datetime(player_df["DOB"])
player_df.set_index("Player_Id", inplace=True)

player_df.head()

,Player_Name,DOB,Batting_hand,Bowling_skill,Country_Name
Player_Id,,,,,
1,SC Ganguly,1972-07-08,1,1.0,1
2,BB McCullum,1981-09-27,2,1.0,4
3,RT Ponting,1974-12-19,2,1.0,5
4,DJ Hussey,1977-07-15,2,2.0,5
5,Mohammad Hafeez,1980-10-17,2,2.0,6

In [4]:
player_df.fillna({"Bowling_skill":0}, inplace=True)
player_df.isnull().sum()

Player_Name      0
DOB              0
Batting_hand     0
Bowling_skill    0
Country_Name     0
dtype: int64

In [5]:
player_df.duplicated().sum()

0

In [6]:
country_df = pd.read_sql_query("select * from country", conn)

In [7]:
country_df.set_index("Country_Id", inplace=True)
country_df.head()

            Country_Name
Country_Id
1                  India
2           South Africa
3                  U.A.E
4            New Zealand
5              Australia

In [8]:
pc_df = player_df.join(country_df, lsuffix="Country_Name", rsuffix="Country_Id")
player_df["Country_Name"] = pc_df["Country_NameCountry_Id"]
player_df.head()

,Player_Name,DOB,Batting_hand,Bowling_skill,Country_Name
Player_Id,,,,,
1,SC Ganguly,1972-07-08,1,1.0,India
2,BB McCullum,1981-09-27,2,1.0,South Africa
3,RT Ponting,1974-12-19,2,1.0,U.A.E
4,DJ Hussey,1977-07-15,2,2.0,New Zealand
5,Mohammad Hafeez,1980-10-17,2,2.0,Australia

In [9]:
player_df["Batting_hand"] = player_df["Batting_hand"].replace(1, "Right").replace(2, "Left")
player_df.head()

,Player_Name,DOB,Batting_hand,Bowling_skill,Country_Name
Player_Id,,,,,
1,SC Ganguly,1972-07-08,Right,1.0,India
2,BB McCullum,1981-09-27,Left,1.0,South Africa
3,RT Ponting,1974-12-19,Left,1.0,U.A.E
4,DJ Hussey,1977-07-15,Left,2.0,New Zealand
5,Mohammad Hafeez,1980-10-17,Left,2.0,Australia

In [10]:
player_df.to_csv("player.csv")